# AnalyticalModelColumnTopExtension Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..AnalyticalModelColumnTopExtension Property
ParameterTypeId Class See Also
---
"Top x Projection"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId AnalyticalModelColumnTopExtension { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property AnalyticalModelColumnTopExtension As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ AnalyticalModelColumnTopExtension {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace